START_TEXT = "👋 Привет! Добро пожаловать в нашего бота!\n\n"\
        "🎨 Здесь ты сможешь создать уникальный аватар по своим фото и генерировать изображения в разных стилях!\n\n"\
        "🔹 **Как это работает?**\n"\
        "1️⃣ Загрузи 10 своих фото\n"\
        "2️⃣ Получи уникальные изображения!\n\n"\
        "💡 Готов начать? Выбери один из вариантов ниже:"

INSTRUCRION_BTN_TEXT = 'Инструкция'
BUY_BTN_TEXT = 'Купить'
REFFERAL_BTN_TEXT = 'Реферальная система'
PROMO_BTN_TEXT = 'Ввести промокод на бесплатные генерации'
EXAMPL_BTN_GENERATIONS = 'Примеры генераций'
CHOISE_TARIFF_BTN = "💰 Выберите пакет генераций:"

DESCRIPTION_BOT = "Этот бот позволяет создавать аватар и генерировать изображения.\n"\
        "📸 Вы загружаете 10 фото, и бот создает уникальный аватар.\n"\
        "🎨 Затем вы можете генерировать фото в разных стилях.\n\n"\
        "✅ **Все понял!** → Подробнее про форматы фото"
        
DESCRIPTION_FIRST_OK = 'Все понял!'
DESCRIPTION_ABOUT_PHOTO = "📏 **Формат фотографий**\n\n"\
        "Чтобы создать аватар, загрузите 10 фотографий:\n"\
        "- **Разные позы**\n"\
        "- **Хорошее освещение**\n"\
        "- **Без очков и головных уборов**\n\n"\
        "➡ **Дальше!** → Описание двух режимов"

DESCRIPTION_SECOND_OK = 'Дальше!'
ABOUT_STYLES_AVATAR_TEXT = 'Сообщения о стилях и аватарах'
COST_QUESTION = 'А сколько стоит?'
ABOUT_TARIFFS = 'Сообение про пакеты'

ADD_FRIEND_TEXT = 'Приглашай друзей и получай баллы'
ADD_FRIEND_TEXT_BTN = 'Пригласить друга'
GET_REFERRAL_LINK = 'Получить реферальную ссылку'
REFFERAL_BALANCE = 'Баланс'
BUY_BY_BALANCE_TEXT = 'Потратить балы'

REF_BALLANCE_INFO_TEXT = 'Информация о балансе'

GO_GENERATE_TEXT = 'Попробовать генерацию'
WITHOUT_PROMOCODE_TEXT = 'Такого промокода нет'

PAY_DOCS_TEXT = "📜 **Пользовательское соглашение**\n\n"\
        "Перед оплатой ознакомьтесь с условиями:\n"
PAY_DOCS_TEXT_BTN = '✅ Подтвердить'   
